_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаСуточных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСуточных</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/ПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаРасходованиеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкиНаРасходованиеДС</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПроектам</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПроектов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>(Общ) Банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьВБухгалтерию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВДДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийППИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДСПроектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте банковского счета (кассы)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДСПроектов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте банковского счета (кассы)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтражатьВДДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисленияНаЗарплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУдержанияСЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоКарточке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаСуточных/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	Для каждого Стр Из Объект.Сотрудники Цикл
		Стр.Сотрудник= Справочники.Сотрудники.НайтиПоРеквизиту("ИНН",Стр.ИНн);
		Если Стр.Сотрудник.пустая() Тогда
			Сообщить("НЕ найден сотрудник "+Стр.ИНН+"  "+СТр.ФИО);
		КонецЕсли;
	КонецЦикла;
	Сообщить("Чтение данных завершено");
	Элементы.Группа1.ТекущаяСтраница=Элементы.Группа3;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	Объект.Сотрудники.Очистить();
	
	Для Сч=1 По ТекстСДанными.КоличествоСтрок() Цикл
		текСтрока = ТекстСДанными.ПолучитьСтроку(Сч);
		ИНН=Сред(текСтрока,1,10);
		ИНН2=Сред(текСтрока,4,10);
		ИНН3=Сред(текСтрока,3,10);
		нПп=Сред(текСтрока,1,2);
		
		ТипСхемы= 0;
		Если ЭтоЧисло(ИНН) Тогда
			ТипСхемы				=1;
		ИНачеЕсли ЭтоЧисло(ИНН3) И ЭтоЧисло(нПп) Тогда
			Если Сред(текСтрока,2,1)=" " Тогда
				ТипСхемы =2;	
			Иначе	
				ТипСхемы =3;	
			КонецЕсли;
		КонецЕсли;	
	
			
		Если ТипСхемы>0 Тогда
			
			Если ТипСхемы=2 Тогда
				текСтрока=Сред(текСтрока,3);
			ИначеЕсли ТипСхемы=3 Тогда
				текСтрока=Сред(текСтрока,4);	
			КонецЕсли;
			ИНН=Сред(текСтрока,1,10);
			ПозицияUA=СтрНайти(текСтрока,"UA");
			Если ПозицияUA>0 Тогда
				нСТр = Объект.Сотрудники.Добавить();
				нСТр.ИНН=ИНН;
				нСТр.ФИО=Сред(текСтрока,12,ПозицияUA-13);
				нСТр.РасчетныйСчет=СтрЗаменить(Сред(текСтрока,ПозицияUA,32)," ","");
				локСумма=СтрЗаменить(Сред(текСтрока,ПозицияUA+33)," ","");
				
				локСумма=Сред(локСумма,1,СтрДлина(локСумма)-?(ТипСхемы=1,2,0));
				нСТр.Сумма=Число(локСумма);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ВалютаГрн= Константы.ВалютаРегламентированногоУчета.Получить();
	СтатьяДвиженияДенежныхСредств= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001047");
	СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("000000078");
	
	СчДок=0;
	
	Для каждого Стр Из Объект.Сотрудники Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Сотрудник)  Тогда
			Сообщить("Не найден сотрудник "+Стр.ФИО);
			Продолжить;
		КонецЕсли;		
		докППИ = НайтиППИ(Стр.ИНН);
		Если НЕ докППИ.Пустая() Тогда
			Продолжить;;
		КонецЕсли;
		
		СчДок=СчДок+1;
		
		докППИ = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
		докППИ.Организация=Организация;
		докППИ.СчетОрганизации=СчетОрганизации;
		докППИ.Дата= ДатаОплаты;
		докППИ.ДатаОплаты= ДатаОплаты;
		докППИ.Оплачено=Истина;
		докППИ.Направление=Направление;
		
		докППИ.ВалютаДокумента=ВалютаГрн;    
		докППИ.ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику;
		докППИ.СтатьяДвиженияДенежныхСредств=СтатьяДвиженияДенежныхСредств;
		докППИ.СтатьяЗатрат =СтатьяЗатрат;
		текСОтр = Справочники.Сотрудники.НайтиПоРеквизиту("ИНН",Стр.ИНН);
		Если ЗначениеЗаполнено(текСОтр) Тогда
			Если ЗначениеЗаполнено(текСОтр.Родитель.СтатьяЗарплата) Тогда
				докППИ.СтатьяДвиженияДенежныхСредств=текСОтр.Родитель.СтатьяЗарплата;		
			КонецЕсли;
		КонецЕсли;
		докППИ.Контрагент= НайтиСоздатьКонтрагента(Стр.ИНН,Стр.ФИО);
		докППИ.СчетКонтрагента= НайтиСоздатьСчетКонтрагента(докППИ.Контрагент,Стр.РасчетныйСчет);
		//докППИ.ДоговорКонтрагента= НайтиСоздатьСчетКонтрагента(докППИ.Контрагент,Стр.РасчетныйСчет);
		
		докППИ.СуммаДокумента=Стр.Сумма;
		докППИ.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		докППИ.НазначениеПлатежа="Аванс на відрядження";
		Попытка
		
				докППИ.Записать(РежимЗаписиДокумента.Проведение);
			
		
		Исключение
				докППИ.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Документ "+ докППИ+" записан, не проведен");
		КонецПопытки;
	
		//Для тестов, создаем 1
		//Возврат;
	КонецЦикла;
	Сообщить("Создание ППИ завершено, создано "+СчДок+" новый документа");
КонецПроцедуры

Функция НайтиСоздатьКонтрагента(ИНН,Наименование)
	Запрос= Новый ЗАпрос;
	Запрос.Текст=    "ВЫБРАТЬ
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.ЕГРПОУ = &ЕГРПОУ
	              |	И Контрагенты.ПометкаУдаления = ЛОЖЬ"    ;
	Запрос.УстановитьПараметр("ЕГРПОУ",ИНН);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ВЫборка.Ссылка;
	КонецЕсли;
	
	СпрК = Справочники.Контрагенты.СоздатьЭлемент();
	СпрК.ЕГРПОУ= ИНН;
	СпрК.Наименование= Наименование;
	СпрК.ФизЮрЛицо=Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	СпрК.Записать();
	
	Возврат СпрК.Ссылка;

КонецФункции // ()

Функция НайтиСоздатьСчетКонтрагента(Контрагент,НомерСчета)
	Запрос= Новый ЗАпрос;
	Запрос.Текст=    "ВЫБРАТЬ
	                 |	БанковскиеСчета.Ссылка
	                 |ИЗ
	                 |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	                 |ГДЕ
	                 |	БанковскиеСчета.Владелец = &Контрагент
	                 |	И БанковскиеСчета.НомерСчета = &НомерСчета
	                 |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ"    ;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("НомерСчета",НомерСчета);
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ВЫборка.Ссылка;
	КонецЕсли;
	
	СпрК = Справочники.БанковскиеСчета.СоздатьЭлемент();
	СпрК.Владелец= Контрагент;
	СпрК.НомерСчета=НомерСчета;
	СпрК.Наименование= НомерСчета;
	СпрК.Банк=Справочники.Банки.НайтиПоКоду("300528");
	СпрК.Записать();
	
	Возврат СпрК.Ссылка;

КонецФункции // ()


Функция НайтиППИ(Инн)
	Запрос = Новый Запрос;
	ЗАпрос.Текст= "ВЫБРАТЬ
	|	ПлатежноеПоручениеИсходящее.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	|ГДЕ
	|	ПлатежноеПоручениеИсходящее.Организация = &Организация
	|	И ПлатежноеПоручениеИсходящее.СчетОрганизации = &СчетОрганизации
	|	И ПлатежноеПоручениеИсходящее.Контрагент.ЕГРПОУ = &ЕГРПОУ
	|	И НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящее.Дата ,ДЕНЬ)= &Дата
	|	И ПлатежноеПоручениеИсходящее.ПометкаУдаления = ЛОЖЬ" ;
	ЗАпрос.УстановитьПараметр("Организация",Организация);
	ЗАпрос.УстановитьПараметр("СчетОрганизации",СчетОрганизации);
	ЗАпрос.УстановитьПараметр("ЕГРПОУ",ИНН);
	ЗАпрос.УстановитьПараметр("Дата",НачалоДня(ДатаОплаты));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка();
	
	
КонецФункции // ()

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Предупреждение("Не заполнена организация",15);
		Возврат;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СчетОрганизации) Тогда
		Предупреждение("Не заполнен СчетОрганизации",15);
		Возврат;	
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаОплаты) Тогда
		Предупреждение("Не заполнена ДатаОплаты",15);
		Возврат;	
	КонецЕсли;

	СоздатьДокументыНаСервере();
КонецПроцедуры

Функция ЭтоЧИсло(Знач ТекСтрока ) ЭКспорт
	локЧисло =0;
	Попытка
	    локЧисло = Число(ТекСтрока);
	Исключение
	
	КонецПопытки;
	Возврат локЧисло>0;
	//ТекСтрока=СокрЛП(ТекСтрока);
	//Для СчСимволов=1 По СтрДлина(ТекСтрока) Цикл
	//	локСимвол=СРед();
	//	
	//
	//КонецЦикла;
КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация=Справочники.Организации.НайтиПоКоду("000000058");
	ДатаОплаты=ТекущаяДата();
КонецПроцедуры
